Revit 2027 API
View.CanModifyDetailLevel Method
 Check if Detail Level can be modified.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanModifyDetailLevel()
Public Function CanModifyDetailLevel As Boolean
public:
bool CanModifyDetailLevel()
member CanModifyDetailLevel : unit -> bool
Return Value
Boolean
 True if Detail Level can be modified.
See Also
Reference
View Class
Autodesk.Revit.DB Namespace